var data = [];

var dataStr = '1、等待今生，与你相守<br>\
<br>\
在那酒后的深夜 我窃取了航标 <br />\
只为从此飘零的心不再无助 <br>\
忘记沉睡已久的旧梦 <br>\
把你的手儿放在我的胸口 <br>\
换个四目相对的姿势 <br>\
在你心灵的大海<br> \
我愿做一只没有帆的小舟<br>\
与你慢慢漂流 <br>\
漂流...<br>\
<br>\
<br>\
2、蒹葭<br>\
<br>\
蒹葭苍苍，白露为霜。<br>\
所谓伊人，在水一方，<br>\
溯洄从之，道阻且长。<br>\
溯游从之，宛在水中央。<br>\
蒹葭萋萋，白露未晞。<br>\
所谓伊人，在水之湄。<br>\
溯洄从之，道阻且跻。<br>\
溯游从之，宛在水中坻。<br>\
蒹葭采采，白露未已。<br>\
所谓伊人，在水之涘。<br>\
溯洄从之，道阻且右。<br>\
溯游从之，宛在水中沚。<br>\
<br>\
<br>\
3、左岸<br>\
<br>\
一见钟情的故事并没有骗人，<br>\
只是那点种子还须日日更新方能不死。<br>\
不要说累啊累啊，你想放弃了，<br>\
你不是追求激情、追求划过夜空的闪亮吗？<br>\
那么，即使成为繁星点点中的一颗也要付出一生。<br>\
所谓爱情，它原本来自欲望，<br>\
只因保持欲望的美丽比什么都难，<br>\
我们才选择了克制！<br>\
因此绝不要相信什么“精神恋爱”可以拯救世界，<br>\
那套说法有利于社会却无益于心灵。<br>\
<br>\
<br>\
4、浪漫的事<br>\
<br>\
我能想到最浪漫的事<br >\
就是和你一起慢慢变老<br>\
一路上收藏点点滴滴的欢笑<br>\
留到以后坐着摇椅慢慢聊<br>\
我能想到最浪漫的事<br>\
就是和你一起慢慢变老<br>\
知道我们老得哪也去不了<br>\
你依然把我当成手心里的宝<br>\
<br>\
<br>\
5、摸鱼儿<br>\
<br>\
问世间、情是何物，<br>\
直教生死相许。<br>\
天南地北双飞客，<br>\
老翅几回寒暑。<br>\
欢乐趣，离别苦。<br>\
就中更有痴儿女，<br>\
君应有语，<br>\
渺万里层云，<br>\
千山暮雪，<br>\
只影为谁去。<br>\
<br>\
<br>\
6、君生我未生，我生君已老<br>\
<br>\
君生我未生，我生君已老。<br >\
君恨我生迟，我恨君生早。<br>\
君生我未生，我生君已老。<br>\
恨不生同时，日日与君好。<br>\
君生我未生，我生君已老。<br>\
我离君天涯，君隔我海角。<br>\
化蝶去寻花，夜夜栖芳草。<br>\
<br>\
<br>\
7、卜算子<br>\
<br>\
我住长江头<br >\
君住长江尾<br>\
日日思君不见君<br>\
共饮长江水<br>\
此水几时休<br>\
此恨何时已<br>\
只愿我君似我心 定不负相思意<br>\
<br>\
<br>\
8、离思<br>\
<br>\
曾经沧海难为水，<br>\
除却巫山不是云。<br>\
取次花丛懒回顾，<br>\
半缘修道半缘君。<br>\
<br>\
<br>\
9、上邪<br>\
<br>\
上邪<br >\
我欲与君相知<br>\
长命无绝衰<br>\
山无陵 江水为竭 <br>\
冬雷震震 夏雨雪 <br>\
天地合<br>\
乃敢与君绝<br>\
<br>\
<br>\
10、爱情颂<br>\
<br>\
生命诚可贵<br >\
自由价更高<br>\
若为爱情故<br>\
两者皆可抛<br>\
<br>\
<br>\
11、约定<br>\
<br>\
远处的钟声回荡在雨里<br >\
我们在屋檐底下牵手听<br>\
幻想教堂里头那场婚礼<br>\
是为祝福我俩而举行<br>\
一路从泥泞走到了美景<br>\
习惯在彼此眼中找勇气<br>\
累到无力总会想吻你<br>\
才能忘了情路艰辛<br>\
<br>\
<br>\
12、凤栖梧<br>\
<br>\
伫倚危楼风细细，<br>\
望极春愁，<br>\
黯黯生天际。<br>\
草色烟光残照里，<br>\
无言谁会凭阑意？<br>\
拟把疏狂图一醉，<br>\
对酒当歌，<br>\
强乐还无味。<br>\
衣带渐宽终不悔，<br>\
为伊消得人憔悴。<br>\
<br>\
<br>\
13、诗经·邶风·击鼓<br>\
<br>\
击鼓其镗，踊跃用兵。<br>\
土国城漕，我独南行。<br>\
从孙子仲，平陈与宋。<br>\
不我以归，忧心有忡。<br> \
爰居爰处？爰丧其马？<br>\
于以求之？于林之下。<br>\
死生契阔，与子成说。<br>\
执子之手，与子偕老。<br>\
于嗟阔兮，不我活兮。<br>\
于嗟洵兮，不我信兮。<br>\
<br>\
<br>\
14、关雎<br>\
<br>\
关关雎鸠，在河之洲。<br>\
窈窕淑女，君子好求。<br>\
参差荇菜，左右流之；<br>\
窈窕淑女，寤寐求之。<br>\
求之不得，寤寐思服；<br>\
悠哉悠哉，辗转反侧。<br>\
参差荇菜，左右采之；<br>\
窈窕淑女，琴瑟友之。<br>\
参差荇菜，左右冒之；<br>\
窈窕淑女，钟鼓乐之。<br>\
<br>\
<br>\
15、鹊桥仙<br>\
<br>\
纤云弄巧，飞星传恨，<br>\
银汉迢迢暗度。<br>\
金风玉露一相逢，<br>\
便胜却、人间无数。<br>\
柔情似水，佳期如梦，<br>\
忍顾鹊桥归路，<br>\
两情若是久长时，<br>\
又岂在、朝朝暮暮。<br>\
<br>\
<br>\
16、致橡树<br>\
<br>\
我如果爱你——绝不学攀援的凌霄花，<br>\
借你的高枝炫耀自己；<br>\
我如果爱你——绝不学痴情的鸟儿，<br>\
为绿荫重复单调的歌曲；<br>\
也不止象泉源常年送来清凉的慰籍；<br>\
也不止象险峰，<br>\
增加你的高度，衬托你的威仪。<br>\
甚至日光 甚至春雨<br>\
<br>\
<br>\
17、爱久久<br>\
<br>\
喜欢你在乎的表情<br>\
尤其是吃醋的样子<br>\
你会说爱我很久很久<br>\
那时最温柔的事<br>\
喜欢坐摩哆的时候<br>\
轻轻靠在你的背后<br>\
让风吹乱你的秀发<br>\
拂去我所有哀愁<br>\
你是我最简单的快乐<br>\
<br>\
<br>\
18、白桦林<br>\
<br>\
静静的村庄飘着白的雪,<br>\
阴霾的天空下鸽子飞翔,<br>\
白桦树刻着那两个名字，<br>\
他们发誓相爱永久这一生，<br>\
';

var d = dataStr.split('<br><br><br>')
  for (var i=0; i < d.length; i++) {
  	var c = d[i].split('<br><br>');
  	data.push ({
  		img : c[0].replace('、','') + '.jpg',
  		caption : c[0].split('、')[1],
  		desc : c[1]
  	});
  	console.log(c[0].replace('、','') +'.jpg');
  }